{
    "lang": "Language",
    "about": "About Me",
    "skill": "Skill",
    "exp": "Experience",
    "resume": "Resume",
    "position": "Front End Developer",
    "taichung": "Taichung",
    "taiwan": "Taiwan",
    "autobiography": "Autobiography",
    "programmingLang": "Programming Language",
    "technologyTool": "Technology & Tool",
    "frontEnd": "Front End",
    "backEnd": "Back End",
    "lioshutan": "Lioshutan",
    "hipower": "Hipower",
    "exosite": "Exosite",
    "bgh": "BGH",
    "other": "Other",
    "front-end-dev": "Front End Developer",
    "full-stack-dev": "Full Stack Developer",
    "intern-qa": "QA Intern",
    "blogger": "Blogger",
    "essential-duties": "Essential Duties",
    "project": "Project",
    "my-slogan": "Nothing Is Impossible, Just Do It",
    "year": "Y",
    "month": "M",
    "now": "Now",
    "automated-test": "automated test",
    "establish-test-environment": "Establish the test environment",
    "test-tool": "Develop the test tool",
    "daily-check": "daily check",
    "web": "Website",
    "search-console": "Search Console",
    "analytics": "Analytics",
    "CMS": "CMS",
    "website-setup": "Website server setup",
    "hamvi-project": "Complete 80% web automated test, APP automated test.",
    "murano-project": "Web automated test and APIs automated test.",
    "independent-dev": "Independent project development from database to front-end display.",
    "front-end-web-dev": "Front-end web development",
    "back-end-dev": "Back-end development",
    "multiple-languages": "Multiple languages",
    "hi-pro-1": "Connect front-end camera to client side.",
    "hi-pro-2": "From build database to front-end development",
    "hi-pro-3": "Web maintenance and development",
    "with-bakc-end": "Cooperate with backend engineers to integrate backend",
    "ci": "and CI",
    "with-ui-ux": "Cooperate with UI/UX engineers to develop the web user interface",
    "e-commerce": "E-commerce system",
    "front-end-web-maintenance": "Front-end web maintenance and optimize",
    "teamwork": "Teamwork and cross-departmental communication",
    "okr": "OKR",
    "image": "Images",
    "optimization": "optimize",
    "handle": "handle",
    "cutobiography-content": "My name is Asa. I am a good self-learner in web technology and programming language. From database to front-end display, I can develop a website project independently, and use new technology on new project. In each case, my programing skill improved. I can always finish tasks in time. This helps me to become an engineer who specialized in writing native JavaScript, using vue framework, npm, webpack and writing css to sass and bootstrap. I even learned how to write unit test. After several project, I’ve learned back-end and also used PDO to call database, wrote APIs so does setup website server. It’s important for me to keep updating my web technology, it helps me to solve more problems and get a sense of accomplishment from it. At the meantime, I enjoy teamwork program developing. In this way, we can stimulate each other’s idea and share useful tools or technique. Knowing each other more is the better when we work together.",
    "web-architecture": "Web Architecture",
    "code-quality": "Code Quality",
    "test": "Test",
    "web-protocol": "Web Protocol",
    "email": "E-mail",
    "external": "External",
    "data-storage": "Data Storage",
    "dev-model-per-ex": "Development Model And Personal Execution",
    "operating-system": "Operating System",
    "version-control": "Version Control",
    "cloud-service": "Cloud Service",
    "self-media-e-commerce": "Self-media And E-commerce",
    "data-analysis": "Data Analysis",
    "server": "Server",
    "package-management-pack-tool": "Package Management And Pack Tool",
    "app-automated-test": "App Automated Test",
    "task-management-tool": "Task Management Tool",
    "dev-tools": "Developer Tools",
    "wuwowEx-content-1": "Develope on the separation of front-end and backend.It can improve develope speed, and focus on ui/ux and web efficacy.",
    "wuwowEx-content-2": "I Use vuex to manage variables, vue router to manage url path, i18n to manage multiple languages and consume REST APIs with Axios.",
    "wuwowEx-content-3": "Use WebSocket to connect between a client and server, and send class information from backend.",
    "wuwowEx-content-4": "Use LocalStorage and Cookie to storage web information.",
    "wuwowEx-content-5": "Use Boostrap and Css to write responsive web design.",
    "wuwowEx-content-6": "Use Webpack to compress and compile code.",
    "wuwowEx-content-7": "Rebuild code and build reusable code for future use.",
    "wuwowEx-content-8": "Storage images on Aws s3, also import CDN images.",
    "wuwowEx-img-content-1": "Use Vue Calendar to improve user experience booking page.",
    "wuwowEx-img-content-2": "According to UI/UX designer's draft to write layout and RWD.",
    "wuwowIn-content-1": "Development method and use technology are the same as WUWOW online learning platform website.",
    "wuwowIn-content-2": "This website is mainly used by internal personnel to manage related information of employees, consultants, and students.",
    "wuwowIn-img-content-1": "The customer service staff's problem handling screen, using WebSocket technology to send out notification messages.",
    "wuwowIn-img-content-2": "Use Vue Chartjs to present data in images.",
    "wushare-content-1": "Use Wordpress content management system.",
    "wushare-content-2": "LearnDash LMS for online learning.",
    "wushare-content-3": "Use WooCommerce to build merchandise and shopping cart system.",
    "wushare-content-4": "Write the customized code in the way of Hook.",
    "wushare-content-5": "Use OAuth plug-in to provide FB and Google third-party login.",
    "wushare-content-6": "Use Rank Math plug-in to score SEO content and improve search engine ranking.",
    "wsapi-content-1": "Develop WebSocket API according to customer requirements, allow the server to continuously connect with the client to transfer data between the camera and the client.",
    "wsapi-content-2": "Use Node.js express back-end development, and build MySQL database by myself.",
    "wsapi-content-3": "Use ES6 technology Promise async await to handle asynchronous issues.",
    "wsapi-content-4": "Callback function to get database data's return value.",
    "wsapi-content-5": "Use Mocha to write unit tests to reduce errors caused when code is changed.",
    "ops-content-1": "According to PM needs and request for proposal writing front-end web page and visual design, and build MySQL database.",
    "ops-content-2": "Import the Vue framework for front-end development for company. PHP back-end development.",
    "ops-content-3": "Use Vue Router to develop with SPA architecture to improve user experience.",
    "ops-content-4": "Use i18n multi-language.",
    "ops-content-5": "Connect with Line Bot API let store send advertising broadcast.",
    "ops-content-6": "Use SMTP server to send registration success and secondary password change notification.",
    "ops-content-7": "Use LocalStorage to store front-end related information.",
    "ops-content-8": "Css3 animation and Sass preprocessor development, write RWD mobile phone version by Media query.",
    "ops-content-9": "Import Npm package management and Webpack for code compilation, packaging and compression for company.",
    "ops-img-content-1": "Use HTML5 WebRTC technology to scan the invoice QRcode and display the invoice-related information.",
    "ops-img-content-2": "Use HTML5 WebRTC technology to scan the QRcode and display purchasing price.",
    "police-content-1": "According to customer request for proposal to write front-end web page and visual design.",
    "police-content-2": "Vue front-end development with PHP back-end development.",
    "police-content-3": "Css3 animation and Sass preprocessor.",
    "police-content-4": "Connect Google Map API to display map camera information and improve user visual experience.",
    "police-content-5": "License plate fuzzy query and fault-tolerant query, providing multiple ways to search license plates.",
    "police-content-6": "Npm package management, also use Webpack for code compilation, packaging and compression.",
    "police-img-content-1": "Login page.",
    "police-img-content-2": "Camera's status information page."
}